{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## task01  知识图谱介绍\n",
    "20210109 created    \n",
    "这个notebook是参加 DataWhale 组织的<知识图谱组队学习>的学习笔记.      \n",
    "原始的开源学习项目地址:     \n",
    "https://github.com/datawhalechina/team-learning-nlp/tree/master/KnowledgeGraph_Basic"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 一、知识图谱简介"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1.1 引言\n",
    "\n",
    "从一开始的Google搜索，到现在的聊天机器人、大数据风控、证券投资、智能医疗、自适应教育、推荐系统，无一不跟知识图谱相关。它在技术领域的热度也在逐年上升。\n",
    "\n",
    "早在 2010 年微软就开始构建知识图谱，包括 Satori 和 Probase；2012 年，Google 正式发布了 Google Knowledge Graph，现在规模已超 700 亿。目前微软和 Google 拥有全世界最大的通用知识图谱，Facebook 拥有全世界最大的社交知识图谱，而阿里巴巴和亚马逊则分别构建了商品知识图谱。\n",
    "\n",
    "![业内布局.jpg](https://i.loli.net/2020/12/06/3CTx6QFOBHctglP.jpg)\n",
    "> 图 1 业内布局\n",
    "\n",
    "![业内应用.jpg](https://i.loli.net/2020/12/06/raF2KwYfvBE1cyQ.jpg)\n",
    "> 图 2 业内应用\n",
    "\n",
    "本章以通俗易懂的方式来讲解知识图谱相关的知识、介绍从零开始搭建知识图谱过程当中需要经历的步骤以及每个阶段。本次组队学习还将动手实践一个关于kg在智能问答中的应用。\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1.2 什么是知识图谱呢？\n",
    "\n",
    "知识图谱是由 Google 公司在 2012 年提出来的一个新的概念。从学术的角度，我们可以对知识图谱给一个这样的定义：“知识图谱本质上是语义网络（Semantic Network）的知识库”。但这有点抽象，所以换个角度，从实际应用的角度出发其实可以简单地把知识图谱理解成多关系图（Multi-relational Graph）。\n",
    "#### 笔记\n",
    "     \n",
    "知识图谱的萌芽在上世纪六十年代就产生了。最初的Frame Network，又叫Semantic Network，就是“节点—关系—属性：这样的结构。 \n",
    "在这种最基本的图结构产生之后，一个重要的方向就是，如何让这个结构支持推理，支持一阶谓词逻辑。在这方面，逻辑学家们做了很多工作，其中重要的工作包括描述逻辑等等。他们基本的思路就是，从逻辑往上走，添加各种结构来支持推理，之后就演变出来了OWL，OWL2，RIF语言等等。另外一条路则是元数据，后来发展成RDF，然后演变出很多语言，之后是schema.org，最后演变到了今天的知识图谱。     \n",
    " \n",
    "* 语义网络   \n",
    "语义网络，semantic network，是描述事物的一种图。   \n",
    "* 语义网  \n",
    "语义网，semantic web，是具有语义的万维网。语义网旨在用具有语义信息的结构化数据格式来描述信息，使得信息不但易于为人所理解，而且也从某种程度上能够为机器所理解。然而当结构化的、具有语义信息的数据的前景呈现的时候，逻辑学家们就开始为其增加便于推理的元素，这导致用来结构化数据的格式过于复杂，增加了人的认知成本（人的理解能力比机器强得多。从一段文本中提取信息的能力，经过专业训练的人的准确率远远高于任何机器。）。      \n",
    "但推理的成本是很高的，这导致强逻辑的语义网，SEMANTIC web搞了很久也没法工程化。这导致一些人开始反思，语义网真的必须首先强调逻辑吗？事实上很多时候只要有了结构化的数据其实就够了。既然目前技术条件下，机器实现逻辑推理的成本太高了，那就先不去强求推理，先把数据结构化、语义化。这就是由谷歌倡导的知识图谱。      \n",
    "* 知识图谱   \n",
    "知识图谱可以理解为弱化（或者不强调）推理机的语义网。   \n",
    "华东理工大学王昊奋对知识图谱的定义为:   \n",
    "知识图谱旨在描述真实世界中存在的各种实体或概念。其中，每个实体或概念用一个全局唯一确定的ID来标识，称为它们的标识符。每个属性-值对用来刻画实体的内在特性，而关系用来连接两个实体，刻画它们之间的关联。    \n",
    "\n",
    "**结构就是一切。** by TBL    \n",
    "我感觉，知识图谱其实只是一种结构化的数据表达方式，这种方式表达的数据能够为人和机器共同阅读（从而机器和人都能够去创造和‘理解’这样的数据），从而能够使得机器有效地连接人和数据，满足人对数据中的蕴含的信息的需求。      \n",
    "一种很自然的想法，就是利用这种结构化的数据表达方式去实现卡尔•波普尔在《客观知识》中所设想的那样一个独立于物理客体世界和意识状态世界之外的思想的客观内容的世界。很多知识库项目，比如cyc，比如Freebase, Wikidata, Yago, DBPedia，都在做这种尝试，想要把整个人类的知识全部用结构化的格式表示出来，这是一个非常美好的梦想。而要实现这种囊括全人类所有关于这个世界全部知识的盛举，一个自顶向下的设计是必不可少的，设计某种结构，并设立一些必要的规则，以便于利用这些规则来进行某种程度上的逻辑推理，都是很自然的想法。      \n",
    "但这种由逻辑学家主导的自顶向下的设计方案，仅考虑推理实现的理论可能性，例如如果一种推理是满足多项式时间的，那么逻辑学家就认为是可以接受的，但实际上要实现这个多项式时间的推理，所消耗的人力成本、机器成本和计算成本都太高了，现实应用场景根本不可能接受（小说里倒是存在，例如《银河系漫游指南》中，老鼠造了一台能回答一切问题的计算机，然后问它，世界的意义是什么？经过了很多世代，计算机终于完成了计算，给出了一个无厘头的答案；另外，阿西莫夫《最后的问题》里两个喝醉酒的系统管理员问Multivac的问题，也直到很多年后当所有的人都与AC——Multivac的更新版本——融和之后，才开始回答这个问题）。实现这种基于某种逻辑（一阶谓词逻辑，然后是描述逻辑）的具有推理功能的语义网设计方案的过程中，它的阶段性产品的可用性也不能得到保证。这种设计纯粹是面向机器的，已经脱离了普通人能够理解的限度，这种做法是不能解决人们的需求。    \n",
    "\n",
    "* 世界知识悖论：        \n",
    "另外一个问题，是目前知识图谱计划中也存在的问题：人需要的是特定领域的知识，不是通用的世界知识。看起来最有用的世界知识，实际上很多时候对人来说是最没用的，因为现阶段多数受过良好教育的用户——那些现阶段就有资格向知识图谱提需求的人，也是潜在的知识图谱的早期用户——都是具有相对够用的世界知识的，他们真正需要的是某个专业领域的知识，例如医疗。这一点大概可以叫做世界知识悖论。很多机构开始认识到这一点，比如IMB的watson，在问答比赛中战胜人类之后，迅速转战医疗领域的问答。\n",
    "当然世界知识确实是有用的。例如，如果能够实现从文本提取本体，以及某种程度上的推理（也许这一点非常难办到），那么，我们建立的这个巨大的世界知识的知识图谱至少可以为新闻从业者提供纠错功能，避免因为记者个人的无知导致有严重错误的新闻被刊登出去。"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 1.2.1 什么是图（Graph）呢？\n",
    "\n",
    "图（Graph）是由节点（Vertex）和边（Edge）来构成，多关系图一般包含多种类型的节点和多种类型的边。实体（节点）指的是现实世界中的事物比如人、地名、概念、药物、公司等，关系（边）则用来表达不同实体之间的某种联系，比如人-“居住在”-北京、张三和李四是“朋友”、逻辑回归是深度学习的“先导知识”等等。\n",
    "\n",
    "![image.png](https://i.loli.net/2020/12/04/ZNWkgnrPpjoHlzq.png)\n",
    "> 图 3 图（Graph）介绍\n",
    "\n",
    "##### 笔记\n",
    "图论是个数学分支。他的研究对象--图是一种抽象的数学结构，这种结构以给丁的若干点以及连接两个点的线段构成。这种图的结构常常用于描述各种事物之间的特定关系，用点来代表事物，而用点之间的线段来代表两个事物之间具有某种关系。   \n",
    "最早的图论问题就是众所周知的哥尼斯堡七桥问题（又称一笔画问题）：对于用七条线段连接起来的四个点（具体图形请自行百度），能否不重复地经过这七条线段？大数学家欧拉因为解决了这个问题，被推崇为图论的创始人。   \n",
    "可以看得出来，图是一种非常抽象的概念。概念的极度抽象性同时也带来了应用的极度广泛性。我们人类对世界的认知，在很大程度就可以用图来表示。    \n",
    "例如，我们阅读一本小说，或欣赏一个连续剧，或者阅读历史书，去认识和记忆当中的人物及其关系时，就是一个经典的图结构： 不同的人用不同的点表示，两个人之间的朋友关系，母女/母子/父女/父子关系，夫妻关系等等，就用线段来表示，这样就构成了一幅包含点和线的图（这里的图就指的是图论中的图）。    \n",
    "这个图可以用来干什么？如果我们把图画得标准一些，具有层次结构一些，那么亲戚关系图就可以帮助我们来“计算”称谓。例如，我应该怎么称呼我七舅老爷的三外甥女？如此种种，甚至更复杂的亲戚关系都能计算出来。"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 1.2.2 什么是 Schema 呢？\n",
    "\n",
    "- 知识图谱另外一个很重要的概念是 Schema:\n",
    "  - 介绍：限定待加入知识图谱数据的格式；相当于某个领域内的数据模型，包含了该领域内有意义的概念类型以及这些类型的属性\n",
    "  - 作用：规范结构化数据的表达，一条数据必须满足Schema预先定义好的实体对象及其类型，才被允许更新到知识图谱中， **一图胜千言**\n",
    "    - 图中的DataType限定了知识图谱节点值的类型为文本、日期、数字（浮点型与整型）\n",
    "    - 图中的Thing限定了节点的类型及其属性（即图1-1中的边）\n",
    "  - 举例说明：基于下图Schema构建的知识图谱中仅可含作品、地方组织、人物；其中作品的属性为电影与音乐、地方组织的属性为当地的商业（eg：饭店、俱乐部等）、人物的属性为歌手\n",
    "  - tips：本次组队学习不涉及schema的构建\n",
    "\n",
    "![Schema定义.PNG](https://i.loli.net/2020/12/06/zxMLupBIewb2jFR.png)\n",
    "> 图 4 Schema定义\n",
    "\n",
    "\n",
    "##### 笔记\n",
    "学过数据库的人都应该对 Schema 不陌生。对于每一个具体的数据库而言，它区分于其他数据库的关键就在于其“结构”，也就是Schema。简单地说，Schema定义了数据库的结构：都有哪些对象（表），每个对象都有哪些属性，每个属性都是什么类型的数据，都有哪些不同取值，等等。    \n",
    "知识图谱的Schema，则是为了构造出一个通用的、共同的Schema。当然具体操作起来，实际上是按照领域来建立这个领域内的通用数据模型。这个数据模型一旦建立，就应该被所有的人所采用。通用的结构，将最大程度地降低不同的人之间的交流成本，也从而能够将更多的知识“融合”起来。"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1.3 知识图谱的价值在哪呢？\n",
    "\n",
    "从图5中可以看出，知识图谱是人工智能很重要的一个分支, 人工智能的目标为了让机器具备像人一样理性思考及做事的能力 ->\n",
    "  在符号主义的引领下，知识工程（核心内容即建设专家系统）取得了突破性的进展 ->\n",
    "  在整个知识工程的分支下，知识表示是一个非常重要的任务 ->\n",
    "  而知识图谱又恰恰是知识表示的重要一环\n",
    "\n",
    "![学科概念.PNG](https://i.loli.net/2020/12/06/5eFvYZ3rnKDWVNt.png)\n",
    "> 图 5 学科概念\n",
    "\n",
    "#### 笔记\n",
    "无论是人工智能，还是知识工程，其目的都是实现更大程度和范围的自动化。而要实现自动化，关键的一点在于能够让人和机器语言相同。然而，人类的语言对于机器而言太难理解了，让机器学会人的语言还不知道要多久。既然机器无法学会人类的自然语言，那能不能设计一种机器语言，让人来学会？知识图谱就是这种努力的一个成果。   \n",
    "因此，知识图谱最大的价值不在于多么符合人的认知，而是能够让机器以较低成本和较高效率对知识图谱进行认知和利用。"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 二、怎么构建知识图谱呢？"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 2.1 知识图谱的数据来源于哪里？\n",
    "\n",
    "知识图谱的构建是后续应用的基础，而且构建的前提是需要把数据从不同的数据源中抽取出来。对于垂直领域的知识图谱来说，它们的数据源主要来自两种渠道：\n",
    "- 第一种：业务本身的数据。这部分数据通常包含在公司内的数据库表并以结构化的方式存储，一般只需要简单预处理即可以作为后续AI系统的输入；\n",
    "- 第二种：网络上公开、抓取的数据。这些数据通常是以网页的形式存在所以是非结构化的数据，一般需要借助于自然语言处理等技术来提取出结构化信息。\n",
    "  \n",
    "![image.png](https://i.loli.net/2020/12/04/ITK1Pg9Oo7n3daF.png)\n",
    "> 图 6 数据来源\n",
    "\n",
    "比如在下面的搜索例子里，Bill Gates和Malinda Gate的关系就可以从非结构化数据中提炼出来，比如维基百科等数据源。\n",
    "\n",
    "![image.png](https://i.loli.net/2020/12/04/XOtDiVkMIE965GZ.png)\n",
    "> 图 7 举例说明\n",
    "\n",
    "\n",
    "#### 笔记\n",
    "说到底，知识图谱也只是一种知识结构而已，因此过往的各种知识结构都可以而且应该被较为容易地转变为知识图谱。关系数据库里保存的内容，以及非结构化自由文本所包含的内容，都应该能够而且是批量地转化为知识图谱结构。"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 2.2 信息抽取的难点在哪里？\n",
    "\n",
    "信息抽取的难点在于处理非结构化数据。在下面的图中，我们给出了一个实例。左边是一段非结构化的英文文本，右边是从这些文本中抽取出来的实体和关系。\n",
    "![image.png](https://i.loli.net/2020/12/04/HDa36LRxTv7EN9l.png)\n",
    "> 图 8 信息抽取的难点举例"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 2.3 构建知识图谱所涉及的技术？\n",
    "\n",
    "在构建类似的图谱过程当中，主要涉及以下几个方面的自然语言处理技术： \n",
    " \n",
    "1. 实体命名识别（Name Entity Recognition）\n",
    "2. 关系抽取（Relation Extraction）\n",
    "3. 实体统一（Entity Resolution）\n",
    "4. 指代消解（Coreference Resolution）\n",
    "5. ...\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 2.4、知识图谱的具体构建技术是什么？\n",
    "\n",
    "下面针对每一项技术解决的问题做简单的描述，至于这些是具体怎么实现的，不在这里一一展开，后续课程和知识图谱第二期的课程将会慢慢展开：\n",
    "\n",
    "![image.png](https://i.loli.net/2020/12/04/HDa36LRxTv7EN9l.png)\n",
    "> 图 9 具体构建技术 示例\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 2.4.1 实体命名识别（Named Entity Recognition）\n",
    "\n",
    "- 实体命名识别（英语：Named Entity Recognition），简称NER\n",
    "  - 目标：就是从文本里提取出实体并对每个实体做分类/打标签；\n",
    "  - 举例说明：比如从上述文本里，我们可以提取出实体-“NYC”，并标记实体类型为 “Location”；我们也可以从中提取出“Virgil's BBQ”，并标记实体类型为“Restarant”。\n",
    "  - 这种过程称之为实体命名识别，这是一项相对比较成熟的技术，有一些现成的工具可以用来做这件事情。\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 2.4.2 关系抽取（Relation Extraction）\n",
    "\n",
    "- 关系抽取（英语：Relation Extraction），简称 RE\n",
    "  - 介绍：通过关系抽取技术，把实体间的关系从文本中提取出来；\n",
    "  - 举例说明：比如实体“hotel”和“Hilton property”之间的关系为“in”；“hotel”和“Time Square”的关系为“near”等等。\n",
    "\n",
    "![image.png](https://i.loli.net/2020/12/04/X7OqhWL6IZbNcke.png)\n",
    "> 图 9 NER 和 RE 示例"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 2.4.3 实体统一（Entity Resolution）\n",
    "\n",
    "- 实体统一（英语：Entity Resolution），简称 ER\n",
    "  - 介绍：对于有些实体写法上不一样，但其实是指向同一个实体；\n",
    "  - 举例说明：比如“NYC”和“New York”表面上是不同的字符串，但其实指的都是纽约这个城市，需要合并。\n",
    "  - 价值：实体统一不仅可以减少实体的种类，也可以降低图谱的稀疏性（Sparsity）；"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 2.4.4 指代消解（Disambiguation）\n",
    "\n",
    "- 指代消解（英语：Disambiguation）\n",
    "  - 介绍：文本中出现的“it”, “he”, “she”这些词到底指向哪个实体，比如在本文里两个被标记出来的“it”都指向“hotel”这个实体。\n",
    "\n",
    "![image.png](https://i.loli.net/2020/12/04/xUVbWp32ZRjHLa8.png)\n",
    "> 图 10 ER 和 Disambiguation 示例"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 三、知识图谱的存储\n",
    "\n",
    "- 知识图谱主要有两种存储方式：\n",
    "  - 一种是基于RDF的存储；\n",
    "  - 另一种是基于图数据库的存储。\n",
    "\n",
    "它们之间的区别如下图所示。RDF一个重要的设计原则是数据的易发布以及共享，图数据库则把重点放在了高效的图查询和搜索上。其次，RDF以三元组的方式来存储数据而且不包含属性信息，但图数据库一般以属性图为基本的表示形式，所以实体和关系可以包含属性，这就意味着更容易表达现实的业务场景。其中Neo4j系统目前仍是使用率最高的图数据库，它拥有活跃的社区，而且系统本身的查询效率高，但唯一的不足就是不支持准分布式。相反，OrientDB和JanusGraph（原Titan）支持分布式，但这些系统相对较新，社区不如Neo4j活跃，这也就意味着使用过程当中不可避免地会遇到一些刺手的问题。如果选择使用RDF的存储系统，Jena或许一个比较不错的选择。\n",
    "\n",
    "![image.png](https://i.loli.net/2020/12/04/kZlqe8f2JMNgGTu.png)\n",
    "> 图 11 RDF的存储 和 基于图数据库的存储 的区别"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 四、Neo4J 介绍与安装"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 4.1 引言\n",
    "\n",
    "“工欲善其事，必先利其器”，知识图谱作为一种特殊的图结构，自然需要专门的图数据库进行存储。\n",
    "\n",
    "知识图谱由于其数据包含实体、属性、关系等，常见的关系型数据库诸如MySQL之类不能很好的体现数据的这些特点，因此知识图谱数据的存储一般是采用图数据库（Graph Databases）。而Neo4j是其中最为常见的图数据库。\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 4.2 Neo4J 下载\n",
    "\n",
    "首先在 [Neo4J官网](https://neo4j.com/download/) 下载 Neo4J。\n",
    "\n",
    "- Neo4J分为社区版和企业版：\n",
    "  - 企业版：收费，在横向扩展、权限控制、运行性能、HA等方面都比社区版好，适合正式的生产环境；\n",
    "  - 社区版：**免费**，普通的学习和开发采用免费社区版就好。\n",
    "\n",
    "\n",
    "##### 笔记\n",
    "除了可以按是否收费区分，实际上Neo4j 也可以区分为服务器版和桌面版。    \n",
    "桌面版的 Neo4j desktop 便于安装调试，并且还可以作为“客户端”来连接服务器上的 Neo4j 服务。 \n",
    "一般而言，在个人电脑上仅仅为了学习和测试，可以安装Neo4j desktop， 有windows版本和Mac版本。   \n",
    "如果是为了在生产环境中提供服务，或者是在linux上安装，则最好安装服务器版。 \n",
    "\n",
    "但无论安装哪一个版本，都需要注意，必须事先安装相应版本的 java 并配置环境变量。\n",
    "**cauions**\n",
    "java 1.8 只能支持 Neo4j 3.x 版本，请勿安装 4.x 版。 如果需要安装 4.x 版，需将java至少升级到11.0及以上。\n",
    "\n",
    "WIN10 上安装桌面版的过程中,踩了几个坑,主要的坑在于教程中说的是java 1.8.0,但在安装了neo4j desktop 1.3.11版本后,发现该版本neo4j desktop要求java 11:\n",
    "警告: ERROR! Neo4j cannot be started using java version 1.8.0_271\n",
    "警告: * Please use Oracle(R) Java(TM) 11, OpenJDK(TM) 11 to run Neo4j Server.\n",
    "\n",
    "此外，在WIN 2008r2上安装无法正常打开。不知道是什么问题。"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 4.3 Neo4J 安装\n",
    "\n",
    "\n",
    "- 在Mac或者Linux中，安装好jdk后，直接解压下载好的Neo4J包，运行命令\n",
    "\n",
    "```s\n",
    "bin/neo4j start\n",
    "```\n",
    "\n",
    "- windows系统下载好neo4j和jdk 1.8.0后，输入以下命令启动后neo4j\n",
    "```s\n",
    "neo4j.bat console\n",
    "```\n",
    "\n",
    "![image](https://i.loli.net/2020/11/28/4aR1sToSEnve6bL.png) \n",
    "> 图 12 Neo4j 运行结果  \n",
    "\n",
    "#### 笔记\n",
    "\n",
    "以下以 centos7 下安装配置 neo4j 3.5.26 为例进行总结。\n",
    "1.java 11的安装配置\n",
    "查看CentOS自带JDK是否已安装\n",
    "```\n",
    "yum list installed |grep java\n",
    "```\n",
    "如已按安装旧版本 java, 根据情况使用如下命令逐个卸载:\n",
    "```\n",
    "yum -y remove java-1.7.0-openjdk-headless.x86_64\n",
    "```\n",
    "然后安装jdk11\n",
    "```\n",
    "yum install -y java-11-openjdk\n",
    "```\n",
    "使用\n",
    "```\n",
    "which java\n",
    "```\n",
    "找到java安装目录\n",
    "\n",
    "然后根据安装目录编辑环境变量的配置文件\n",
    "```\n",
    "vi /etc/profile\n",
    "/usr/lib/jvm/java-11-openjdk-11.0.9.11-2.el7_9.x86_64/bin/java\n",
    "```\n",
    "在文件底部加入以下配置  \n",
    "```\n",
    "export JAVA_HOME=/usr/lib/jvm/java-11-openjdk-11.0.9.11-2.el7_9.x86_64/bin/java\n",
    "export JRE_HOME=$JAVA_HOME/jre\n",
    "export CLASSPATH=$JAVA_HOME/lib:$JRE_HOME/lib:$CLASSPATH\n",
    "export PATH=$JAVA_HOME/bin:$JRE_HOME/bin:$PATH\n",
    "```\n",
    "刷新配置，使其生效  \n",
    "```\n",
    "source /etc/profile\n",
    "```\n",
    "测试配置结果  \n",
    "```\n",
    "echo $JAVA_HOME\n",
    "``` \n",
    "参考:\n",
    "卸载 https://jingyan.baidu.com/article/4853e1e51d0c101909f72607.html\n",
    "安装 https://www.4gml.com/thread-121.htm\n",
    "\n",
    "* 2.neo4j的安装与配置 \n",
    "官网上有使用yum方法的安装介绍，但实际上直接下载操作起来更方便。\n",
    "在完成 java 的安装之后， 从 https://neo4j.com/download-center/#community 下载社区版neo4j的服务器版本，然后解压缩，在终端进入解压缩文件夹，使用命令\n",
    "```\n",
    "neo4j.bat console\n",
    "```\n",
    "即可启动neo4j服务。这时使用地址 http://localhost:7474/browser/ 就能访问到neo4j服务了。\n",
    "\n",
    "但是既然已经在linux上安装了，那么很有必要作一下配置以便于从其他电脑上访问neo4j服务。\n",
    "\n",
    "* 3.配置Neo4j服务器允许远程访问\n",
    "找到 neo4j-community-3.1.3\\conf\\neo4j.conf  文件，修改\n",
    "```\n",
    "#dbms.connector.http.listen_address=:7474\n",
    "```\n",
    "为 \n",
    "```\n",
    "dbms.connector.http.listen_address=0.0.0.0:7474\n",
    "``` \n",
    "远程bolt连接：\n",
    "```\n",
    "#dbms.connector.bolt.listen_address=:7687\n",
    "```\n",
    "改为：\n",
    "```\n",
    "dbms.connector.bolt.listen_address=0.0.0.0:7687\n",
    "``` \n",
    "选择连接数据库：\n",
    "```\n",
    "dbms.active_database=importData\n",
    "```\n",
    "此时需要把：\n",
    "```\n",
    "#dbms.allow_format_migration=true\n",
    "```\n",
    "改为：\n",
    "```\n",
    "dbms.allow_format_migration=true\n",
    "```\n",
    "\n",
    "配置环境变量：\n",
    "```\n",
    "#neo4j\n",
    "export NEO4J_HOME=/.../neo4j\n",
    "export PATH=$PATH:$NEO4J_HOME/bin\n",
    "```\n",
    "然后在其他电脑上就可访问了（初始用户名密码均为neo4j）\n",
    "![](img/20210111202729.png)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 4.4 Neo4J Web 界面 介绍\n",
    "\n",
    "Neo4J提供了一个用户友好的 Web 界面，可以进行各项配置、写入、查询等操作，并且提供了可视化功能。类似ElasticSearch一样，我个人非常喜欢这种开箱即用的设计。\n",
    "\n",
    "打开浏览器，输入http://127.0.0.1:7474/browser/ ，如下图 13 所示，界面最上方就是交互的输入框。\n",
    "\n",
    "![image](https://i.loli.net/2020/11/28/wtkmLaIjiWDlRh4.png)\n",
    "> 图 13 Neo4J Web界面"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 4.5 Cypher查询语言\n",
    "\n",
    "- Cypher：\n",
    "  - 介绍：是Neo4J的声明式图形查询语言，允许用户不必编写图形结构的遍历代码，就可以对图形数据进行高效的查询。\n",
    "  - 设计目的：类似SQL，适合于开发者以及在数据库上做点对点模式（ad-hoc）查询的专业操作人员。\n",
    "  - 其具备的能力包括： \n",
    "    - 创建、更新、删除节点和关系 \n",
    "    - 通过模式匹配来查询和修改节点和关系 - 管理索引和约束等\n",
    "\n",
    "#### 笔记\n",
    "和SQL一样，Cypher也是声明式语言。    \n",
    "这种语言的特点是，用户只需要把自己的需求翻译成这种语言，而不必告诉程序如何去找到所要的结果。比如，你想要知道姚明的妻子是谁，就直接把这个问题翻译成Cypher语言，而不需告诉程序应该怎么去找。   \n",
    "这种声明式的语言，似乎看起来不像是很有效率的样子，但却非常适合人的需求——每个人都会使用声明式的语言来提出自己的问题和要求，而不会事无巨细地操心每一个步骤。例如你到饭店点菜，只会提出自己的需求，而不必告诉厨师该怎么做这道菜。"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 五、Neo4J 实战"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 5.1 引言\n",
    "\n",
    "这个案例的节点主要包括人物和城市两类，人物和人物之间有朋友、夫妻等关系，人物和城市之间有出生地的关系。特别鸣谢知乎@异尘[手把手教你快速入门知识图谱 - Neo4J教程](https://zhuanlan.zhihu.com/p/88745411)\n",
    "\n",
    "- Person-Friends-PERSON\n",
    "- Person-Married-PERSON\n",
    "- Person-Born_in-Location"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 5.2 创建节点\n",
    "\n",
    "1. 删除数据库中以往的图，确保一个空白的环境进行操作【注：慎用，如果库内有重要信息的话】：\n",
    "\n",
    "![image.png](https://i.loli.net/2020/12/04/3q4LDMCyZ2Hwemf.png)\n",
    "> 图 14 Neo4J 删库操作\n",
    "\n",
    "```Cypher\n",
    "  MATCH (n) DETACH DELETE n\n",
    "```\n",
    "\n",
    "这里，MATCH是匹配操作，而小括号()代表一个节点node（可理解为括号类似一个圆形），括号里面的n为标识符。\n",
    "\n",
    "2. 创建一个人物节点：\n",
    "   \n",
    "```Cypher\n",
    "  CREATE (n:Person {name:'John'}) RETURN n\n",
    "```\n",
    "> 注：<br/>\n",
    "> CREATE是创建操作，Person是标签，代表节点的类型。<br/>\n",
    "> 花括号{}代表节点的属性，属性类似Python的字典。<br/>\n",
    "> 这条语句的含义就是创建一个标签为Person的节点，该节点具有一个name属性，属性值是John。\n",
    "\n",
    "3. 创建更多的人物节点，并分别命名：\n",
    "   \n",
    "```Cypher\n",
    "  CREATE (n:Person {name:'Sally'}) RETURN n\n",
    "  CREATE (n:Person {name:'Steve'}) RETURN n\n",
    "  CREATE (n:Person {name:'Mike'}) RETURN n\n",
    "  CREATE (n:Person {name:'Liz'}) RETURN n\n",
    "  CREATE (n:Person {name:'Shawn'}) RETURN n\n",
    "```\n",
    "\n",
    "如图 15 所示，6个人物节点创建成功\n",
    "\n",
    "![image](https://i.loli.net/2021/01/03/W4RwifuO7MhDjdI.png)\n",
    "> 图 15 创建 人物节点\n",
    "\n",
    "4. 创建地区节点\n",
    "\n",
    "```Cypher\n",
    "  CREATE (n:Location {city:'Miami', state:'FL'})\n",
    "  CREATE (n:Location {city:'Boston', state:'MA'})\n",
    "  CREATE (n:Location {city:'Lynn', state:'MA'})\n",
    "  CREATE (n:Location {city:'Portland', state:'ME'})\n",
    "  CREATE (n:Location {city:'San Francisco', state:'CA'})\n",
    "```\n",
    "\n",
    "可以看到，节点类型为Location，属性包括city和state。\n",
    "\n",
    "如图 16 所示，共有6个人物节点、5个地区节点，Neo4J贴心地使用不用的颜色来表示不同类型的节点。\n",
    "\n",
    "![image](https://i.loli.net/2021/01/03/uGaBt1MQ7jksXnE.png)\n",
    "> 图 16 创建地区节点\n",
    "\n",
    "##### 笔记\n",
    "在同时执行上述多条语句的时候报错。根据写SQL的经验，猜测应该是需要用分隔符分割五个语句，增加分号后执行成功。\n",
    "![](img/20210111204558.png)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 5.3 创建关系\n",
    "\n",
    "1. 朋友关系\n",
    "\n",
    "```Cypher\n",
    "  MATCH (a:Person {name:'Liz'}), \n",
    "        (b:Person {name:'Mike'}) \n",
    "  MERGE (a)-[:FRIENDS]->(b)\n",
    "```\n",
    "> 注：<br/>\n",
    "> 方括号[]即为关系，FRIENDS为关系的类型。<br/>\n",
    "> 注意这里的箭头-->是有方向的，表示是从a到b的关系。 这样，Liz和Mike之间建立了FRIENDS关系。\n",
    "\n",
    "2. 关系增加属性\n",
    "\n",
    "```Cypher\n",
    "  MATCH (a:Person {name:'Shawn'}), \n",
    "        (b:Person {name:'Sally'}) \n",
    "  MERGE (a)-[:FRIENDS {since:2001}]->(b)\n",
    "```\n",
    "\n",
    "3. 增加更多的朋友关系：\n",
    "\n",
    "```Cypher\n",
    "  MATCH (a:Person {name:'Shawn'}), (b:Person {name:'John'}) MERGE (a)-[:FRIENDS {since:2012}]->(b)\n",
    "  MATCH (a:Person {name:'Mike'}), (b:Person {name:'Shawn'}) MERGE (a)-[:FRIENDS {since:2006}]->(b)\n",
    "  MATCH (a:Person {name:'Sally'}), (b:Person {name:'Steve'}) MERGE (a)-[:FRIENDS {since:2006}]->(b)\n",
    "  MATCH (a:Person {name:'Liz'}), (b:Person {name:'John'}) MERGE (a)-[:MARRIED {since:1998}]->(b)\n",
    "```\n",
    "\n",
    "这样，图谱就已经建立好了：\n",
    "\n",
    "![image.png](https://i.loli.net/2021/01/03/MtrHeLFakZc3w6N.png)\n",
    "> 图 17 图谱"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 5.4 创建 出生地关系\n",
    "\n",
    "1. 建立不同类型节点之间的关系-人物和地点的关系\n",
    "\n",
    "```Cypher\n",
    "  MATCH (a:Person {name:'John'}), (b:Location {city:'Boston'}) MERGE (a)-[:BORN_IN {year:1978}]->(b)\n",
    "  MATCH (a:Person {name:'Liz'}), (b:Location {city:'Boston'}) MERGE (a)-[:BORN_IN {year:1981}]->(b)\n",
    "  MATCH (a:Person {name:'Mike'}), (b:Location {city:'San Francisco'}) MERGE (a)-[:BORN_IN {year:1960}]->(b)\n",
    "  MATCH (a:Person {name:'Shawn'}), (b:Location {city:'Miami'}) MERGE (a)-[:BORN_IN {year:1960}]->(b)\n",
    "  MATCH (a:Person {name:'Steve'}), (b:Location {city:'Lynn'}) MERGE (a)-[:BORN_IN {year:1970}]->(b)\n",
    "```\n",
    "\n",
    "这里的关系是BORN_IN，表示出生地，同样有一个属性，表示出生年份。\n",
    "\n",
    "如图 18 ，在人物节点和地区节点之间，人物出生地关系已建立好。\n",
    "\n",
    "2. 创建节点的时候就建好关系\n",
    "\n",
    "```Cypher\n",
    "  CREATE (a:Person {name:'Todd'})-[r:FRIENDS]->(b:Person {name:'Carlos'})\n",
    "```\n",
    "最终该图谱如下图所示：\n",
    "\n",
    "![image.png](https://i.loli.net/2021/01/03/Hr7T5iOPNcIERfh.png)\n",
    "> 图 18 图谱"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 5.5 图数据库查询\n",
    "\n",
    "1. 查询下所有在Boston出生的人物\n",
    "\n",
    "```Cypher\n",
    "  MATCH (a:Person)-[:BORN_IN]->(b:Location {city:'Boston'}) RETURN a,b\n",
    "```\n",
    "结果如图 19：\n",
    "\n",
    "![image.png](https://i.loli.net/2021/01/03/Kxp5R2ybON9etlQ.png)\n",
    "> 图 19 查询下所有在Boston出生的人物\n",
    "\n",
    "2. 查询所有对外有关系的节点\n",
    "\n",
    "```Cypher\n",
    "  MATCH (a)--() RETURN a\n",
    "```\n",
    "结果如图 20：\n",
    "\n",
    "![查询所有对外有关系的节点](https://i.loli.net/2021/01/03/WjCsr4aLnO1kvo7.png)\n",
    "> 图 20 查询所有对外有关系的节点\n",
    "\n",
    "3. 查询所有有关系的节点\n",
    "\n",
    "```Cypher\n",
    "  MATCH (a)-[r]->() RETURN a.name, type(r)\n",
    "```\n",
    "结果如图21：\n",
    "\n",
    "![image.png](https://i.loli.net/2021/01/03/WjCsr4aLnO1kvo7.png)\n",
    "> 图 21 查询所有有关系的节点\n",
    "\n",
    "4. 查询所有对外有关系的节点，以及关系类型\n",
    "\n",
    "```Cypher\n",
    "  MATCH (a)-[r]->() RETURN a.name, type(r)\n",
    "```\n",
    "\n",
    "结果如图22：\n",
    "\n",
    "![image.png](https://i.loli.net/2021/01/03/WjCsr4aLnO1kvo7.png)\n",
    "> 图 22 查询所有对外有关系的节点，以及关系类型\n",
    "\n",
    "5. 查询所有有结婚关系的节点\n",
    "\n",
    "```Cypher\n",
    "  MATCH (n)-[:MARRIED]-() RETURN n\n",
    "```\n",
    "\n",
    "结果如图 23：\n",
    "\n",
    "![image.png](https://i.loli.net/2021/01/03/DU9gAIHnlxY4WkM.png)\n",
    "> 图 23 查询所有有结婚关系的节点\n",
    "\n",
    "6. 查找某人的朋友的朋友\n",
    "\n",
    "```Cypher\n",
    "  MATCH (a:Person {name:'Mike'})-[r1:FRIENDS]-()-[r2:FRIENDS]-(friend_of_a_friend) RETURN friend_of_a_friend.name AS fofName\n",
    "```\n",
    "返回Mike的朋友的朋友，结果如图 24：\n",
    "\n",
    "![image.png](https://i.loli.net/2021/01/03/egoTxlC36Dbarv9.png)\n",
    "> 图 24 查找某人的朋友的朋友"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 5.6 删除和修改\n",
    "\n",
    "1. 增加/修改节点的属性\n",
    "\n",
    "```Cypher\n",
    "  MATCH (a:Person {name:'Liz'}) SET a.age=34\n",
    "  MATCH (a:Person {name:'Shawn'}) SET a.age=32\n",
    "  MATCH (a:Person {name:'John'}) SET a.age=44\n",
    "  MATCH (a:Person {name:'Mike'}) SET a.age=25\n",
    "```\n",
    "这里，SET表示修改操作\n",
    "\n",
    "2. 删除节点的属性\n",
    "\n",
    "```Cypher\n",
    "  MATCH (a:Person {name:'Mike'}) SET a.test='test'\n",
    "  MATCH (a:Person {name:'Mike'}) REMOVE a.test\n",
    "```\n",
    "删除属性操作主要通过REMOVE\n",
    "3. 删除节点\n",
    "\n",
    "```Cypher\n",
    "  MATCH (a:Location {city:'Portland'}) DELETE a\n",
    "```\n",
    "删除节点操作是DELETE\n",
    "4. 删除有关系的节点\n",
    "\n",
    "```Cypher\n",
    "  MATCH (a:Person {name:'Todd'})-[rel]-(b:Person) DELETE a,b,rel\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 六、通过 Python 操作 Neo4j"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 6.1 neo4j模块：执行CQL ( cypher ) 语句\n",
    "\n",
    "```python\n",
    "# step 1：导入 Neo4j 驱动包\n",
    "from neo4j import GraphDatabase\n",
    "# step 2：连接 Neo4j 图数据库\n",
    "driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"password\"))\n",
    "# 添加 关系 函数\n",
    "def add_friend(tx, name, friend_name):\n",
    "    tx.run(\"MERGE (a:Person {name: $name}) \"\n",
    "    \"MERGE (a)-[:KNOWS]->(friend:Person {name: $friend_name})\",\n",
    "    name=name, friend_name=friend_name)\n",
    "# 定义 关系函数\n",
    "def print_friends(tx, name):\n",
    "    for record in tx.run(\"MATCH (a:Person)-[:KNOWS]->(friend) WHERE a.name = $name\"\n",
    "    \"RETURN friend.name ORDER BY friend.name\", name=name):\n",
    "    print(record[\"friend.name\"])\n",
    "    \n",
    "# step 3：运行\n",
    "  with driver.session() as session:\n",
    "      session.write_transaction(add_friend, \"Arthur\", \"Guinevere\")\n",
    "      session.write_transaction(add_friend, \"Arthur\", \"Lancelot\")\n",
    "      session.write_transaction(add_friend, \"Arthur\", \"Merlin\")\n",
    "      session.read_transaction(print_friends, \"Arthur\")\n",
    "```\n",
    "上述程序的核心部分，抽象一下就是：\n",
    "\n",
    "```python\n",
    "  neo4j.GraphDatabase.driver(xxxx).session().write_transaction(函数(含tx.run(CQL语句)))\n",
    "```\n",
    "或者\n",
    "\n",
    "```python\n",
    "  neo4j.GraphDatabase.driver(xxxx).session().begin_transaction.run(CQL语句)\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# step 0: 安装Neo4j 驱动包\n",
    "# !pip install neo4j #已安装"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "# step 1：导入 Neo4j 驱动包\n",
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "# step 2：连接 Neo4j 图数据库\n",
    "driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"TA5HRyd7p6xfQUr\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    " # 添加 关系 函数\n",
    "def add_friend(tx, name, friend_name):    \n",
    "    tx.run(\"MERGE (a:Person {name: $name}) \"          \n",
    "           \"MERGE (a)-[:KNOWS]->(friend:Person {name: $friend_name})\",            \n",
    "    name=name, friend_name=friend_name)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 定义 关系函数\n",
    "def print_friends(tx, name):\n",
    "    for record in tx.run(\"MATCH (a:Person)-[:KNOWS]->(friend) WHERE a.name = $name \"\n",
    "                         \"RETURN friend.name ORDER BY friend.name\", name=name):\n",
    "        print(record[\"friend.name\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Guinevere\n",
      "Lancelot\n",
      "Merlin\n"
     ]
    }
   ],
   "source": [
    " # step 3：运行\n",
    "with driver.session() as session:\n",
    "    session.write_transaction(add_friend, \"Arthur\", \"Guinevere\")\n",
    "    session.write_transaction(add_friend, \"Arthur\", \"Lancelot\")\n",
    "    session.write_transaction(add_friend, \"Arthur\", \"Merlin\")\n",
    "    session.read_transaction(print_friends, \"Arthur\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 6.2 py2neo模块：通过操作python变量，达到操作neo4j的目的\n",
    "\n",
    "```python\n",
    "# step 1：导包\n",
    "from py2neo import Graph, Node, Relationship\n",
    "# step 2：构建图\n",
    "g = Graph()\n",
    "# step 3：创建节点\n",
    "tx = g.begin()\n",
    "a = Node(\"Person\", name=\"Alice\")\n",
    "tx.create(a)\n",
    "b = Node(\"Person\", name=\"Bob\")\n",
    "# step 4：创建边\n",
    "ab = Relationship(a, \"KNOWS\", b)\n",
    "# step 5：运行\n",
    "tx.create(ab)\n",
    "tx.commit()\n",
    "```\n",
    "py2neo模块符合python的习惯，写着感觉顺畅，其实可以完全不会CQL也能写"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#### 代码实践"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#step 0: 安装 py2neo\n",
    "#!pip install py2neo #已安装"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "# step 1：导包\n",
    "from py2neo import Graph, Node, Relationship\n",
    "# 导入的 Graph 用于建立Python到 Neo4j 的连接 \n",
    "# 导入的 Node 用于在图数据库中创建节点\n",
    "# 导入的 Relationship 用于在图数据库中创建关系"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\u001b[0;31mInit signature:\u001b[0m \u001b[0mGraph\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mprofile\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mname\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0msettings\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
       "\u001b[0;31mSource:\u001b[0m        \n",
       "\u001b[0;32mclass\u001b[0m \u001b[0mGraph\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mobject\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;34m\"\"\" The `Graph` class provides a handle to an individual named\u001b[0m\n",
       "\u001b[0;34m    graph database exposed by a Neo4j graph database service.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m    Connection details are provided using either a URI or a\u001b[0m\n",
       "\u001b[0;34m    :class:`.ConnectionProfile`, plus individual settings, if required.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m    The `name` argument allows selection of a graph database by name.\u001b[0m\n",
       "\u001b[0;34m    When working with Neo4j 4.0 and above, this can be any name defined\u001b[0m\n",
       "\u001b[0;34m    in the system catalogue, a full list of which can be obtained\u001b[0m\n",
       "\u001b[0;34m    through the Cypher ``SHOW DATABASES`` command. Passing `None` here\u001b[0m\n",
       "\u001b[0;34m    will select the default database, as defined on the server. For\u001b[0m\n",
       "\u001b[0;34m    earlier versions of Neo4j, the `name` must be set to `None`.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        >>> from py2neo import Graph\u001b[0m\n",
       "\u001b[0;34m        >>> sales = Graph(\"bolt+s://g.example.com:7687\", name=\"sales\")\u001b[0m\n",
       "\u001b[0;34m        >>> sales.run(\"MATCH (c:Customer) RETURN c.name\")\u001b[0m\n",
       "\u001b[0;34m         c.name\u001b[0m\n",
       "\u001b[0;34m        ---------------\u001b[0m\n",
       "\u001b[0;34m         John Smith\u001b[0m\n",
       "\u001b[0;34m         Amy Pond\u001b[0m\n",
       "\u001b[0;34m         Rory Williams\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m    The `system graph`, which is available in all 4.x+ product editions,\u001b[0m\n",
       "\u001b[0;34m    can also be accessed via the :class:`.SystemGraph` class.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        >>> from py2neo import SystemGraph\u001b[0m\n",
       "\u001b[0;34m        >>> sg = SystemGraph(\"bolt+s://g.example.com:7687\")\u001b[0m\n",
       "\u001b[0;34m        >>> sg.call(\"dbms.security.listUsers\")\u001b[0m\n",
       "\u001b[0;34m         username | roles | flags\u001b[0m\n",
       "\u001b[0;34m        ----------|-------|-------\u001b[0m\n",
       "\u001b[0;34m         neo4j    |  null | []\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m    In addition to the core `connection details <#getting-connected>`_\u001b[0m\n",
       "\u001b[0;34m    that can be passed to the constructor, the :class:`.Graph` class\u001b[0m\n",
       "\u001b[0;34m    can accept several other settings:\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m    ===================  ========================================================  ==============  =========================\u001b[0m\n",
       "\u001b[0;34m    Keyword              Description                                               Type            Default\u001b[0m\n",
       "\u001b[0;34m    ===================  ========================================================  ==============  =========================\u001b[0m\n",
       "\u001b[0;34m    ``user_agent``       User agent to send for all connections                    str             `(depends on URI scheme)`\u001b[0m\n",
       "\u001b[0;34m    ``max_connections``  The maximum number of simultaneous connections permitted  int             40\u001b[0m\n",
       "\u001b[0;34m    ===================  ========================================================  ==============  =========================\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m    Once obtained, the `Graph` instance provides direct or indirect\u001b[0m\n",
       "\u001b[0;34m    access to most of the functionality available within py2neo.\u001b[0m\n",
       "\u001b[0;34m    \"\"\"\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;31m#: The :class:`.GraphService` to which this :class:`.Graph` belongs.\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0mservice\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;31m#: The :class:`.Schema` resource for this :class:`.Graph`.\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0mschema\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0m__init__\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mprofile\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mname\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0msettings\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mservice\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mGraphService\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mprofile\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0msettings\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m__name__\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mname\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mschema\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mSchema\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_procedures\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mProcedureLibrary\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0m__repr__\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mif\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mname\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m            \u001b[0;32mreturn\u001b[0m \u001b[0;34m\"%s(%r)\"\u001b[0m \u001b[0;34m%\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m__class__\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m__name__\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mservice\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0muri\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m            \u001b[0;32mreturn\u001b[0m \u001b[0;34m\"%s(%r, name=%r)\"\u001b[0m \u001b[0;34m%\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m__class__\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m__name__\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mservice\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0muri\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mname\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0m__eq__\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mother\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m            \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mservice\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0mother\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mservice\u001b[0m \u001b[0;32mand\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m__name__\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0mother\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m__name__\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mexcept\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0mAttributeError\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mTypeError\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m            \u001b[0;32mreturn\u001b[0m \u001b[0;32mFalse\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0m__ne__\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mother\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mreturn\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m__eq__\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mother\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0m__len__\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mreturn\u001b[0m \u001b[0mlen\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrelationships\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0m__bool__\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mreturn\u001b[0m \u001b[0;32mTrue\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0m__nonzero__\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0m__bool__\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0mauto\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mreadonly\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mFalse\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m             \u001b[0;31m# after=None, metadata=None, timeout=None\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m             \u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;34m\"\"\" Create a new auto-commit :class:`~py2neo.database.work.Transaction`.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        :param readonly: if :py:const:`True`, will begin a readonly\u001b[0m\n",
       "\u001b[0;34m            transaction, otherwise will begin as read-write\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        *New in version 2020.0.*\u001b[0m\n",
       "\u001b[0;34m        \"\"\"\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mreturn\u001b[0m \u001b[0mTransaction\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;32mTrue\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mreadonly\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m                           \u001b[0;31m# after, metadata, timeout\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m                           \u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0mbegin\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mautocommit\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mFalse\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mreadonly\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mFalse\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m              \u001b[0;31m# after=None, metadata=None, timeout=None\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m              \u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;34m\"\"\" Begin a new :class:`~py2neo.database.work.Transaction`.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        :param autocommit: (deprecated) if :py:const:`True`, the\u001b[0m\n",
       "\u001b[0;34m            transaction will automatically commit after the first\u001b[0m\n",
       "\u001b[0;34m            operation\u001b[0m\n",
       "\u001b[0;34m        :param readonly: if :py:const:`True`, will begin a readonly\u001b[0m\n",
       "\u001b[0;34m            transaction, otherwise will begin as read-write\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        *Changed in version 2020.0: the 'autocommit' argument is now\u001b[0m\n",
       "\u001b[0;34m        deprecated. Use the 'auto' method instead.*\u001b[0m\n",
       "\u001b[0;34m        \"\"\"\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mif\u001b[0m \u001b[0mautocommit\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m            \u001b[0mwarn\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"Graph.begin(autocommit=True) is deprecated, \"\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m                 \u001b[0;34m\"use Graph.auto() instead\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcategory\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mDeprecationWarning\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mstacklevel\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;36m2\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mreturn\u001b[0m \u001b[0mTransaction\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mautocommit\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mreadonly\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m                           \u001b[0;31m# after, metadata, timeout\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m                           \u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;34m@\u001b[0m\u001b[0mproperty\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0mcall\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;34m\"\"\" Accessor for listing and calling procedures.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        This property contains a :class:`.ProcedureLibrary` object tied\u001b[0m\n",
       "\u001b[0;34m        to this graph, which provides links to Cypher procedures in\u001b[0m\n",
       "\u001b[0;34m        the underlying implementation.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        Calling a procedure requires only the regular Python function\u001b[0m\n",
       "\u001b[0;34m        call syntax::\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m            >>> g = Graph()\u001b[0m\n",
       "\u001b[0;34m            >>> g.call.dbms.components()\u001b[0m\n",
       "\u001b[0;34m             name         | versions   | edition\u001b[0m\n",
       "\u001b[0;34m            --------------|------------|-----------\u001b[0m\n",
       "\u001b[0;34m             Neo4j Kernel | ['3.5.12'] | community\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        The object returned from the call is a :class:`.Cursor` object,\u001b[0m\n",
       "\u001b[0;34m        identical to that obtained from running a normal Cypher query,\u001b[0m\n",
       "\u001b[0;34m        and can therefore be consumed in a similar way.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        Procedure names can alternatively be supplied as a string::\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m            >>> g.call[\"dbms.components\"]()\u001b[0m\n",
       "\u001b[0;34m             name         | versions   | edition\u001b[0m\n",
       "\u001b[0;34m            --------------|------------|-----------\u001b[0m\n",
       "\u001b[0;34m             Neo4j Kernel | ['3.5.12'] | community\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        Using :func:`dir` or :func:`iter` on the `call` attribute will\u001b[0m\n",
       "\u001b[0;34m        yield a list of available procedure names.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        *New in version 2020.0.*\u001b[0m\n",
       "\u001b[0;34m        \"\"\"\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_procedures\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0mcreate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msubgraph\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;34m\"\"\" Run a :meth:`~py2neo.database.work.Transaction.create` operation within a\u001b[0m\n",
       "\u001b[0;34m        :class:`~py2neo.database.work.Transaction`.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        :param subgraph: a :class:`.Node`, :class:`.Relationship` or other\u001b[0m\n",
       "\u001b[0;34m                       :class:`.Subgraph`\u001b[0m\n",
       "\u001b[0;34m        \"\"\"\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mwith\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mbegin\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0mtx\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m            \u001b[0mtx\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcreate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msubgraph\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0mdelete\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msubgraph\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;34m\"\"\" Run a :meth:`~py2neo.database.work.Transaction.delete` operation within an\u001b[0m\n",
       "\u001b[0;34m        auto-commit :class:`~py2neo.database.work.Transaction`. To delete only the\u001b[0m\n",
       "\u001b[0;34m        relationships, use the :meth:`.separate` method.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        Note that only entities which are bound to corresponding\u001b[0m\n",
       "\u001b[0;34m        remote entities though the ``graph`` and ``identity``\u001b[0m\n",
       "\u001b[0;34m        attributes will trigger a deletion.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        :param subgraph: a :class:`.Node`, :class:`.Relationship` or other\u001b[0m\n",
       "\u001b[0;34m                       :class:`.Subgraph` object\u001b[0m\n",
       "\u001b[0;34m        \"\"\"\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mauto\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdelete\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msubgraph\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0mdelete_all\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;34m\"\"\" Delete all nodes and relationships from this :class:`.Graph`.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        .. warning::\u001b[0m\n",
       "\u001b[0;34m            This method will permanently remove **all** nodes and relationships\u001b[0m\n",
       "\u001b[0;34m            from the graph and cannot be undone.\u001b[0m\n",
       "\u001b[0;34m        \"\"\"\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"MATCH (a) DETACH DELETE a\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0mevaluate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcypher\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwparameters\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;34m\"\"\" Run a :meth:`~py2neo.database.work.Transaction.evaluate` operation within an\u001b[0m\n",
       "\u001b[0;34m        auto-commit :class:`~py2neo.database.work.Transaction`.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        :param cypher: Cypher statement\u001b[0m\n",
       "\u001b[0;34m        :param parameters: dictionary of parameters\u001b[0m\n",
       "\u001b[0;34m        :return: first value from the first record returned or\u001b[0m\n",
       "\u001b[0;34m                 :py:const:`None`.\u001b[0m\n",
       "\u001b[0;34m        \"\"\"\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mauto\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mevaluate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcypher\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwparameters\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0mexists\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msubgraph\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;34m\"\"\" Run a :meth:`~py2neo.database.work.Transaction.exists` operation within an\u001b[0m\n",
       "\u001b[0;34m        auto-commit :class:`~py2neo.database.work.Transaction`.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        :param subgraph: a :class:`.Node`, :class:`.Relationship` or other\u001b[0m\n",
       "\u001b[0;34m                       :class:`.Subgraph` object\u001b[0m\n",
       "\u001b[0;34m        :return:\u001b[0m\n",
       "\u001b[0;34m        \"\"\"\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0mreadonly\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mservice\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mconnector\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msupports_readonly_transactions\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mauto\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mreadonly\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mreadonly\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mexists\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msubgraph\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0mmatch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mnodes\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mr_type\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mlimit\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;34m\"\"\" Match and return all relationships with specific criteria.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        For example, to find all of Alice's friends::\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m            for rel in graph.match((alice, ), r_type=\"FRIEND\"):\u001b[0m\n",
       "\u001b[0;34m                print(rel.end_node[\"name\"])\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        :param nodes: Sequence or Set of start and end nodes (:const:`None` means any node);\u001b[0m\n",
       "\u001b[0;34m                a Set implies a match in any direction\u001b[0m\n",
       "\u001b[0;34m        :param r_type: type of relationships to match (:const:`None` means any type)\u001b[0m\n",
       "\u001b[0;34m        :param limit: maximum number of relationships to match (:const:`None` means unlimited)\u001b[0m\n",
       "\u001b[0;34m        \"\"\"\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mreturn\u001b[0m \u001b[0mRelationshipMatcher\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mmatch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mnodes\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mnodes\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mr_type\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mr_type\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mlimit\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mlimit\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0mmatch_one\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mnodes\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mr_type\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;34m\"\"\" Match and return one relationship with specific criteria.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        :param nodes: Sequence or Set of start and end nodes (:const:`None` means any node);\u001b[0m\n",
       "\u001b[0;34m                a Set implies a match in any direction\u001b[0m\n",
       "\u001b[0;34m        :param r_type: type of relationships to match (:const:`None` means any type)\u001b[0m\n",
       "\u001b[0;34m        \"\"\"\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0mmatches\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mmatch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mnodes\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mnodes\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mr_type\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mr_type\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mlimit\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;36m1\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0mrels\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mlist\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmatches\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mif\u001b[0m \u001b[0mrels\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m            \u001b[0;32mreturn\u001b[0m \u001b[0mrels\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;36m0\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m            \u001b[0;32mreturn\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0mmerge\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msubgraph\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mlabel\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m*\u001b[0m\u001b[0mproperty_keys\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;34m\"\"\" Run a :meth:`~py2neo.database.work.Transaction.merge` operation within an\u001b[0m\n",
       "\u001b[0;34m        auto-commit :class:`~py2neo.database.work.Transaction`.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        The example code below shows a simple merge for a new relationship\u001b[0m\n",
       "\u001b[0;34m        between two new nodes:\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m            >>> from py2neo import Graph, Node, Relationship\u001b[0m\n",
       "\u001b[0;34m            >>> g = Graph()\u001b[0m\n",
       "\u001b[0;34m            >>> a = Node(\"Person\", name=\"Alice\", age=33)\u001b[0m\n",
       "\u001b[0;34m            >>> b = Node(\"Person\", name=\"Bob\", age=44)\u001b[0m\n",
       "\u001b[0;34m            >>> KNOWS = Relationship.type(\"KNOWS\")\u001b[0m\n",
       "\u001b[0;34m            >>> g.merge(KNOWS(a, b), \"Person\", \"name\")\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        Following on, we then create a third node (of a different type) to\u001b[0m\n",
       "\u001b[0;34m        which both the original nodes connect:\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m            >>> c = Node(\"Company\", name=\"ACME\")\u001b[0m\n",
       "\u001b[0;34m            >>> c.__primarylabel__ = \"Company\"\u001b[0m\n",
       "\u001b[0;34m            >>> c.__primarykey__ = \"name\"\u001b[0m\n",
       "\u001b[0;34m            >>> WORKS_FOR = Relationship.type(\"WORKS_FOR\")\u001b[0m\n",
       "\u001b[0;34m            >>> g.merge(WORKS_FOR(a, c) | WORKS_FOR(b, c))\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        For details of how the merge algorithm works, see the\u001b[0m\n",
       "\u001b[0;34m        :meth:`~py2neo.database.work.Transaction.merge` method. Note that this is different\u001b[0m\n",
       "\u001b[0;34m        to a Cypher MERGE.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        :param subgraph: a :class:`.Node`, :class:`.Relationship` or other\u001b[0m\n",
       "\u001b[0;34m                       :class:`.Subgraph` object\u001b[0m\n",
       "\u001b[0;34m        :param label: label on which to match any existing nodes\u001b[0m\n",
       "\u001b[0;34m        :param property_keys: property keys on which to match any existing nodes\u001b[0m\n",
       "\u001b[0;34m        \"\"\"\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mwith\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mbegin\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0mtx\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m            \u001b[0mtx\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mmerge\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msubgraph\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mlabel\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m*\u001b[0m\u001b[0mproperty_keys\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;34m@\u001b[0m\u001b[0mproperty\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0mname\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;34m\"\"\" The name of this graph.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        *New in version 2020.0.*\u001b[0m\n",
       "\u001b[0;34m        \"\"\"\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m__name__\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;34m@\u001b[0m\u001b[0mproperty\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0mnodes\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;34m\"\"\" A :class:`.NodeMatcher` for this graph.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        This can be used to find nodes that match given criteria:\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m            >>> graph = Graph()\u001b[0m\n",
       "\u001b[0;34m            >>> graph.nodes[1234]\u001b[0m\n",
       "\u001b[0;34m            (_1234:Person {name: 'Alice'})\u001b[0m\n",
       "\u001b[0;34m            >>> graph.nodes.get(1234)\u001b[0m\n",
       "\u001b[0;34m            (_1234:Person {name: 'Alice'})\u001b[0m\n",
       "\u001b[0;34m            >>> graph.nodes.match(\"Person\", name=\"Alice\").first()\u001b[0m\n",
       "\u001b[0;34m            (_1234:Person {name: 'Alice'})\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        Nodes can also be efficiently counted using this attribute:\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m            >>> len(graph.nodes)\u001b[0m\n",
       "\u001b[0;34m            55691\u001b[0m\n",
       "\u001b[0;34m            >>> len(graph.nodes.match(\"Person\", age=33))\u001b[0m\n",
       "\u001b[0;34m            12\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        \"\"\"\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mreturn\u001b[0m \u001b[0mNodeMatcher\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0mplay\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mwork\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0margs\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mkwargs\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mreadonly\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m             \u001b[0;31m# after=None, metadata=None, timeout=None\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m             \u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;34m\"\"\" Call a function representing a transactional unit of work.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        The function must always accept a :class:`~py2neo.database.work.Transaction`\u001b[0m\n",
       "\u001b[0;34m        object as its first argument. Additional arguments can be\u001b[0m\n",
       "\u001b[0;34m        passed though the `args` and `kwargs` arguments of this method.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        A unit of work can be designated \"readonly\" if the work\u001b[0m\n",
       "\u001b[0;34m        function has an attribute called `readonly` which is set to\u001b[0m\n",
       "\u001b[0;34m        :py:const:`True`. This can be overridden by using the\u001b[0m\n",
       "\u001b[0;34m        `readonly` argument to this method which, if set to either\u001b[0m\n",
       "\u001b[0;34m        :py:const:`True` or :py:const:`False`, will take precedence.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        :param work: function containing the unit of work\u001b[0m\n",
       "\u001b[0;34m        :param args: sequence of additional positional arguments to\u001b[0m\n",
       "\u001b[0;34m            pass into the function\u001b[0m\n",
       "\u001b[0;34m        :param kwargs: mapping of additional keyword arguments to\u001b[0m\n",
       "\u001b[0;34m            pass into the function\u001b[0m\n",
       "\u001b[0;34m        :param readonly: set to :py:const:`True` or :py:const:`False` to\u001b[0m\n",
       "\u001b[0;34m            override the readonly attribute of the work function\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        *New in version 2020.0.*\u001b[0m\n",
       "\u001b[0;34m        \"\"\"\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mif\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0mcallable\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mwork\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m            \u001b[0;32mraise\u001b[0m \u001b[0mTypeError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"Unit of work is not callable\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0mkwargs\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mdict\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mkwargs\u001b[0m \u001b[0;32mor\u001b[0m \u001b[0;34m{\u001b[0m\u001b[0;34m}\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mif\u001b[0m \u001b[0mreadonly\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m            \u001b[0mreadonly\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mgetattr\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mwork\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m\"readonly\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;32mFalse\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mif\u001b[0m \u001b[0mreadonly\u001b[0m \u001b[0;32mand\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mservice\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mconnector\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msupports_readonly_transactions\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m            \u001b[0;32mraise\u001b[0m \u001b[0mTypeError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"The underlying connection profile \"\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m                            \u001b[0;34m\"does not support readonly transactions\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;31m# if not timeout:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;31m#     timeout = getattr(work, \"timeout\", None)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0mtx\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mbegin\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mreadonly\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mreadonly\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m                        \u001b[0;31m# after=after, metadata=metadata, timeout=timeout\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m                        \u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m            \u001b[0;32mfrom\u001b[0m \u001b[0minspect\u001b[0m \u001b[0;32mimport\u001b[0m \u001b[0misgenerator\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m            \u001b[0mvalue\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mwork\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mtx\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m*\u001b[0m\u001b[0margs\u001b[0m \u001b[0;32mor\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwargs\u001b[0m \u001b[0;32mor\u001b[0m \u001b[0;34m{\u001b[0m\u001b[0;34m}\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m            \u001b[0;32mif\u001b[0m \u001b[0misgenerator\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mvalue\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m                \u001b[0m_\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mlist\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mvalue\u001b[0m\u001b[0;34m)\u001b[0m     \u001b[0;31m# exhaust the generator\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mexcept\u001b[0m \u001b[0mException\u001b[0m\u001b[0;34m:\u001b[0m  \u001b[0;31m# TODO: catch transient and retry, if within limit\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m            \u001b[0mtx\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrollback\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m            \u001b[0;32mraise\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m            \u001b[0;32mreturn\u001b[0m \u001b[0mtx\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcommit\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0mpull\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msubgraph\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;34m\"\"\" Pull data to one or more entities from their remote counterparts.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        :param subgraph: the collection of nodes and relationships to pull\u001b[0m\n",
       "\u001b[0;34m        \"\"\"\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0mreadonly\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mservice\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mconnector\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msupports_readonly_transactions\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mwith\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mbegin\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mreadonly\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mreadonly\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0mtx\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m            \u001b[0mtx\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mpull\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msubgraph\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0mpush\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msubgraph\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;34m\"\"\" Push data from one or more entities to their remote counterparts.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        :param subgraph: the collection of nodes and relationships to push\u001b[0m\n",
       "\u001b[0;34m        \"\"\"\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mwith\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mbegin\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0mtx\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m            \u001b[0mtx\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mpush\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msubgraph\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0mread\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcypher\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwparameters\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;34m\"\"\" Run a single readonly query within an auto-commit\u001b[0m\n",
       "\u001b[0;34m        :class:`~py2neo.database.work.Transaction`.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        :param cypher: Cypher statement\u001b[0m\n",
       "\u001b[0;34m        :param parameters: dictionary of parameters\u001b[0m\n",
       "\u001b[0;34m        :param kwparameters: extra parameters supplied as keyword\u001b[0m\n",
       "\u001b[0;34m            arguments\u001b[0m\n",
       "\u001b[0;34m        :returns:\u001b[0m\n",
       "\u001b[0;34m        :raises TypeError: if the underlying connection profile does not\u001b[0m\n",
       "\u001b[0;34m            support readonly transactions\u001b[0m\n",
       "\u001b[0;34m        \"\"\"\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mif\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mservice\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mconnector\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msupports_readonly_transactions\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m            \u001b[0;32mraise\u001b[0m \u001b[0mTypeError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"The underlying connection profile \"\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m                            \u001b[0;34m\"does not support readonly transactions\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mauto\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mreadonly\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mTrue\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcypher\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwparameters\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;34m@\u001b[0m\u001b[0mproperty\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0mrelationships\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;34m\"\"\" A :class:`.RelationshipMatcher` for this graph.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        This can be used to find relationships that match given criteria\u001b[0m\n",
       "\u001b[0;34m        as well as efficiently count relationships.\u001b[0m\n",
       "\u001b[0;34m        \"\"\"\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mreturn\u001b[0m \u001b[0mRelationshipMatcher\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcypher\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwparameters\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;34m\"\"\" Run a single read/write query within an auto-commit\u001b[0m\n",
       "\u001b[0;34m        :class:`~py2neo.database.work.Transaction`.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        :param cypher: Cypher statement\u001b[0m\n",
       "\u001b[0;34m        :param parameters: dictionary of parameters\u001b[0m\n",
       "\u001b[0;34m        :param kwparameters: extra parameters supplied as keyword\u001b[0m\n",
       "\u001b[0;34m            arguments\u001b[0m\n",
       "\u001b[0;34m        :return:\u001b[0m\n",
       "\u001b[0;34m        \"\"\"\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mauto\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcypher\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwparameters\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m    \u001b[0;32mdef\u001b[0m \u001b[0mseparate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msubgraph\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0;34m\"\"\" Run a :meth:`~py2neo.database.work.Transaction.separate`\u001b[0m\n",
       "\u001b[0;34m        operation within an auto-commit :class:`~py2neo.database.work.Transaction`.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        Note that only relationships which are bound to corresponding\u001b[0m\n",
       "\u001b[0;34m        remote relationships though the ``graph`` and ``identity``\u001b[0m\n",
       "\u001b[0;34m        attributes will trigger a deletion.\u001b[0m\n",
       "\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m        :param subgraph: a :class:`.Node`, :class:`.Relationship` or other\u001b[0m\n",
       "\u001b[0;34m                       :class:`.Subgraph`\u001b[0m\n",
       "\u001b[0;34m        \"\"\"\u001b[0m\u001b[0;34m\u001b[0m\n",
       "\u001b[0;34m\u001b[0m        \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mauto\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mseparate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msubgraph\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
       "\u001b[0;31mFile:\u001b[0m           ~/anaconda3/lib/python3.8/site-packages/py2neo/database/__init__.py\n",
       "\u001b[0;31mType:\u001b[0m           type\n",
       "\u001b[0;31mSubclasses:\u001b[0m     SystemGraph\n"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "Graph??"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "# step 2：构建图\n",
    "g = Graph(\"http://localhost:7474\", username=\"neo4j\", password=\"TA5HRyd7p6xfQUr\")\n",
    "# 注意将用户名密码按自己的设置来填写,否则报错\n",
    "# ClientError: [Security.Unauthorized] The client is unauthorized due to authentication failure."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "# step 3：创建节点\n",
    "tx = g.begin()\n",
    "a = Node(\"Person\", name=\"Alice\")\n",
    "tx.create(a)\n",
    "b = Node(\"Person\", name=\"Bob\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "# step 4：创建边\n",
    "ab = Relationship(a, \"KNOWS\", b)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Bookmark >"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# step 5：运行\n",
    "tx.create(ab)\n",
    "tx.commit()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 七、通过csv文件批量导入图数据\n",
    "\n",
    "前面学习的是单个创建节点，不适合大批量导入。这里我们介绍使用neo4j-admin import命令导入，适合部署在docker环境下的neo4j。\n",
    "其他导入方法也可以参考[Neo4j之导入数据](https://zhuanlan.zhihu.com/p/93746655)\n",
    "\n",
    "csv分为两个nodes.csv和relations.csv，注意关系里的起始节点必须是在nodes.csv里能找到的：\n",
    "\n",
    "```Cypher\n",
    "  # nodes.csv需要指定唯一ID和nam,\n",
    "  headers = [\n",
    "  'unique_id:ID', # 图数据库中节点存储的唯一标识\n",
    "  'name', # 节点展示的名称\n",
    "  'node_type:LABEL', # 节点的类型，比如Person和Location\n",
    "  'property' # 节点的其他属性\n",
    "  ]\n",
    "```\n",
    "\n",
    "```Cypher\n",
    "  # relations.csv\n",
    "  headers = [\n",
    "  'unique_id', # 图数据库中关系存储的唯一标识\n",
    "  'begin_node_id:START_ID', # begin_node和end_node的值来自于nodes.csv中节点\n",
    "  'end_node_id:END_ID',\n",
    "  'begin_node_name',\n",
    "  'end_node_name',\n",
    "  'begin_node_type',\n",
    "  'end_node_type',\n",
    "  'relation_type:TYPE', # 关系的类型，比如Friends和Married\n",
    "  'property' # 关系的其他属性\n",
    "  ]\n",
    "```\n",
    "制作出两个csv后，通过以下步骤导入neo4j:\n",
    "\n",
    "1. 两个文件nodes.csv ，relas.csv放在\n",
    "\n",
    "```s\n",
    "  neo4j安装绝对路径/import\n",
    "```\n",
    "2. 导入到图数据库mygraph.db\n",
    "\n",
    "```s\n",
    "  neo4j bin/neo4j-admin import --nodes=/var/lib/neo4j/import/nodes.csv --relationships=/var/lib/neo4j/import/relas.csv   --delimiter=^ --database=xinfang*.db\n",
    "```\n",
    "delimiter=^ 指的是csv的分隔符\n",
    "\n",
    "3. 指定neo4j使用哪个数据库\n",
    "\n",
    "```s\n",
    "  修改 /root/neo4j/conf/neo4j.conf 文件中的 dbms.default_database=mygraph.db\n",
    "```\n",
    "\n",
    "4. 重启neo4j就可以看到数据已经导入成功了"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "\n",
    "\n",
    "## 参考资料\n",
    "\n",
    "1. [干货 | 从零到一学习知识图谱的技术与应用](https://blog.csdn.net/guleileo/article/details/80879158)\n",
    "2. [手把手教你快速入门知识图谱 - Neo4J教程](https://zhuanlan.zhihu.com/p/88745411)\n",
    "3. [python操作图数据库neo4j的两种方式](https://zhuanlan.zhihu.com/p/82958776)\n",
    "4. [Neo4j之导入数据](https://zhuanlan.zhihu.com/p/93746655)\n",
    "5. [schema 介绍](https://schema.org/)\n",
    "6. [知识图谱Schema](https://ai.baidu.com/tech/kg/schema)\n",
    "7. [美团大脑：知识图谱的建模方法及其应用](https://tech.meituan.com/2018/11/01/meituan-ai-nlp.html)\n",
    "8. [肖仰华. *知识图谱：概念与技术*．北京：电子工业出版社, 2020．2－39．](https://item.jd.com/10166718622.html)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
